module CheXingYi
  GLOBAL_CODES = {
    0   => "成功",
    -1  => "缺少必要的参数或找不到车牌前缀所匹配的城市",
    -3  => "本系统暂不提供该城市违章查询请求",
    -5  => "服务器错误（超时，数据获取异常等）",
    -10 => "未被授权访问该服务或用户名密码不正确",
    -20 => "未知错误",
    -40 => "未被授权查询此车牌信息",
    -41 => "输入参数不符合数据源要求",
    -42 => "数据源暂不可用",
    -43 => "当日查询数已达到授权数标准，无法继续查询",
    -44 => "已达到查询上限",
    -45 => "确认数据完整性，是否被篡改",
    -6  => "错误：您输入信息有误",
    -61 => "输入车牌号有误",
    -62 => "输入车架号有误",
    -63 => "输入发动机号有误",
    -66 => "不支持的车辆类型",
    -67 => "该省份（城市）不支持异地车牌"
  }
end